[
  {
    "-0/14885388/65-": "An empty array is filled with zeros. This array represents your grades"
  },
  {
    "-0/14885388/65-": "Java is like your mom, it takes care of you. C will let you drive your car right off the track"
  },
  {
    "-0/14885388/65-": "Java won't let you do what you want, C on the other hand let's you do whatever which is great cause if I want to do something dumb I don't want to let a language stop me"
  },
  {
    "-2019/9/12-": "I can't do math in public."
  },
  {
    "-2019/9/12-": "This toast isn't magnetic."
  },
  {
    "-2019/9/12-": "Has anyone actually verified that I work for the university?"
  },
  {
    "-2019/9/12-": "mistake? NO! BECAUSE I BELIEVE IN MYSELF."
  },
  {
    "-2019/9/16-": "You have a wallet, I have a wallet. What's the difference? Mine has a lot of money in it. Remember, tuition's due in two weeks."
  },
  {
    "-2019/9/16-": "What takes more time: drawing a diagram or retaking the course again next year?"
  },
  {
    "-2019/9/16-": "They do things there with cheese curds that you'd only imagine"
  },
  {
    "-2019/9/16-": "Go to Quebec and spend a thousand dollars on fried chicken"
  },
  {
    "-2019/9/16-": "There's a variable out here and it's kind of... chilly, and weird, and spooky."
  },
  {
    "-2019/9/16-": "I shouldn't trust my own thoughts, and you should consider not trusting yours"
  },
  {
    "-2019/9/16-": "This demo will take up the last 5 minutes, and that's my passive aggressive way of telling you there is 5 minutes left in class"
  },
  {
    "-2019/9/17-": "We dont care how the toaster works, we just care that the toaster works"
  },
  {
    "-2019/9/17-": "It would be great if everybody just left; that's fine, I'd just leave too!"
  },
  {
    "-2019/9/17-": "Is anybody here today?"
  },
  {
    "-2019/9/17-": "No"
  },
  {
    "-2019/9/17-": "I gotta hydrate first, this is going to be a tough one"
  },
  {
    "-2019/9/17-": "I'd bet, if some of you reach into your pockets you'd pull out a wallet"
  },
  {
    "-2019/9/17-": "If you pull out your wallet, should I expect you to pull out my credit card?"
  },
  {
    "-2019/9/17-": "Now I realize you all just have this weird applause fetish"
  },
  {
    "-2019/9/17-": "If you reach into your wallet and pull out my credit card that would be impressive"
  },
  {
    "-2019/9/17-": "Nobody is reacting, and that means everyone with a monday or tuesday lab has dropped the course"
  },
  {
    "-2019/9/17-": "We have to give them a name... I guess"
  },
  {
    "-2019/9/17-": "Really its the University's fault for having seats there"
  },
  {
    "-2019/9/17-": "The way you become comfortable is by being uncomfortable and just doing it"
  },
  {
    "-2019/9/17-": "Anyone else want to leave in protest of this being an operator?"
  },
  {
    "-2019/9/17-": "You have no idea how much of the stationary budget goes into red pens"
  },
  {
    "-2019/9/17-": "Ive prepared the next half hour of the lecture hoping that you would ask that question"
  },
  {
    "-2019/9/17-": "Instead of notes you can also bring one standard letter sized sheet of paper. I will provide the dimensions closer to the time"
  },
  {
    "-2019/9/17-": "I do not understand the linear passage of time"
  },
  {
    "-2019/9/17-": "If I go into the horrifying nothingness and find nothing, then I return a compiler error"
  },
  {
    "-2019/9/17-": "The chalk is leaving in protest"
  },
  {
    "-2019/9/18-": "the computer and I have been together for years, so it's sorta like a old married couple"
  },
  {
    "-2019/9/18-": "the course is bill bird."
  },
  {
    "-2019/9/18-": "try me, if you don't believe me, try me, and I'll see you next year"
  },
  {
    "-2019/9/18-": "HOW IS THE BATTERY LOW? oh I didn't have it plugged in"
  },
  {
    "-2019/9/18-": "oh, I didn't plug it in, old married couple problems, you know"
  },
  {
    "-2019/9/18-": "I mean pointers are great, I love pointers, some of my best friend are pointers"
  },
  {
    "-2019/9/19-": "IF ONLY THERE WAS SOMETHING I COULD WRITE IN THE C LANGUAGE THAT COULD TEST SOMETHING FOR ME!"
  },
  {
    "-2019/9/19-": "Maybe the tech people are scared of me, and that's why they showed up so quickly"
  },
  {
    "-2019/9/19-": "The diagram does the work for us"
  },
  {
    "-2019/9/19-": "Oh shit, I don't know my name"
  },
  {
    "-2019/9/19-": "As long as you get toast, how you create the toast doesn't matter as long as it does the job it's supposed to"
  },
  {
    "-2019/9/19-": "I'll go to my office and wait for the call from HR. I'm sure they've got me on speed dial at this point"
  },
  {
    "-2019/9/19-": "Once you've designed a complete toaster, I assume it's going to follow the rules"
  },
  {
    "-2019/9/19-": "YOU HAVE PAID FOR 3 MORE MINUTES OF MY VALUABLE TIME, SO YOU'RE GONNA DAMN LISTEN"
  },
  {
    "-2019/9/19-": "I'M STILL NOT DONE TALKING"
  },
  {
    "-2019/9/19-": "We had some fun times with the projector. We laughed, we cried, we mostly cried"
  },
  {
    "-2019/9/19-": "The chalk doesn't believe me either"
  },
  {
    "-2019/9/19-": "It's not that bad! Some of you won't be there by then!"
  },
  {
    "-2019/9/19-": "Am I gonna moan about being back at my office at 6:00pm? Damn right I am! I earned that right!"
  },
  {
    "-2019/9/19-": "Well yes it's true that I go home after six and listen to a Spotify playlist of applause"
  },
  {
    "-2019/9/19-": "If someone brings a sheet of carbon paper to an exam I will like them so much that I will fail them so I can see them next year"
  },
  {
    "-2019/9/19-": "Something seems dissonant about 7"
  },
  {
    "-2019/9/19-": "Is someone going to close the door? No, I guess the people in the lobby are going to learn programming I guess"
  },
  {
    "-2019/9/19-": "Assignment 1 went well for everybody, assignment 2 will not go so well."
  },
  {
    "-2019/9/19-": "The computer screen is just motivational text"
  },
  {
    "-2019/9/19-": "Would you like me to pull this from linear algebra instead?"
  },
  {
    "-2019/9/19-": "Assignment 5 wont be that bad, some of you wont be here then"
  },
  {
    "-2019/9/19-": "Anyone want to keep moaning because math is hard?"
  },
  {
    "-2019/9/19-": "How do I print out a stair?"
  },
  {
    "-2019/9/19-": "There is this wonderful recording of applause from Europe"
  },
  {
    "-2019/9/19-": "If you remember correctly one of the pre requisites for this class was fourth grade"
  },
  {
    "-2019/9/19-": "Its like a small animal, always dragging dead things into the house. I mean its a small lion, its a CLion"
  },
  {
    "-2019/9/19-": "I am hereby defining carbon paper as not electronic"
  },
  {
    "-2019/9/19-": "If anybody does that I will be so impress that I will fail them to have them in my class again"
  },
  {
    "-2019/9/19-": "If I didn't teach computer science I would teach linear algebra"
  },
  {
    "-2019/9/19-": "I need like a stamp that gives me these numbers"
  },
  {
    "-2019/9/19-": "The Int version reassures you."
  },
  {
    "-2019/9/19-": "My mother said the main thing you learn in Cambel River is to leave Cambel River"
  },
  {
    "-2019/9/19-": "Maybe I want to make toast recreationally"
  },
  {
    "-2019/9/19-": "Why do we like toasters?"
  },
  {
    "-2019/9/19-": "This is not an engineering problem, its an ethical one"
  },
  {
    "-2019/9/19-": "The ability to create small appliances is very powerful."
  },
  {
    "-2019/9/19-": "I assume its someone else's problem, like past me."
  },
  {
    "-2019/9/19-": "Ill explain it in a week, but its pointless"
  },
  {
    "-2019/9/19-": "A sensible person would just not print z is the first place."
  },
  {
    "-2019/9/19-": "Im kinda done asking questions at this point."
  },
  {
    "-2019/9/19-": "Maybe the reason Im doing this is that its scary and I don't want to think about it."
  },
  {
    "-2019/9/19-": "If you returned 3 someone would then go lookup what 3 means in a manual."
  },
  {
    "-2019/9/19-": "What's that noise, is it a vague packing up noise?"
  },
  {
    "-2019/9/23-": "It's called FORTRAN in all caps because apparently lowercase letters hadn't been invented yet"
  },
  {
    "-2019/9/23-": "There's the most cop-out two you'll ever see"
  },
  {
    "-2019/9/23-": "If you leave your possessions in the common area, is it possible something bad might happen to them?"
  },
  {
    "-2019/9/23-": "The one person that is attending today believes, now if only I can believe in myself"
  },
  {
    "-2019/9/23-": "It's turtles all the way down"
  },
  {
    "-2019/9/23-": "As usual, the answer is let the diagram do the work for you"
  },
  {
    "-2019/9/23-": "You should be able to show up to the midterm with no sleep and let the diagram do the work for you"
  },
  {
    "-2019/9/23-": "The P word, pointers"
  },
  {
    "-2019/9/23-": "there are certain dark arts..."
  },
  {
    "-2019/9/23-": "Anyone else want me to torture the laptop?"
  },
  {
    "-2019/9/23-": "If you've ever seen any guff, you know it's no laughing matter."
  },
  {
    "-2019/9/24-": "Just like natural selection, this place has cleared out"
  },
  {
    "-2019/9/24-": "The applause recordings just mean nothing to me anymore"
  },
  {
    "-2019/9/24-": "Just to be clear, are all of you still looking at the sunshine?"
  },
  {
    "-2019/9/24-": "Because I can make it gloomy!"
  },
  {
    "-2019/9/24-": "The is probably someone out there that calls themselves a Calculus Engineer... And that's just, well, that's just adorable."
  },
  {
    "-2019/9/24-": "I had dreams and ambitions and then I got a Coop job writing FORTRAN"
  },
  {
    "-2019/9/24-": "Don't make me close the second set of blinds!"
  },
  {
    "-2019/9/24-": "There's a second set?"
  },
  {
    "-2019/9/24-": "I don't know but who's to say I was right the first time!"
  },
  {
    "-2019/9/24-": "I take an eraser and I Absolutely Obliterate"
  },
  {
    "-2019/9/24-": "They must write really aggressively"
  },
  {
    "-2019/9/24-": "Is everybody getting a cold already?"
  },
  {
    "-2019/9/24-": "When your teaching C, apparently you become indestructible"
  },
  {
    "-2019/9/24-": "Even for me it was a bit boring"
  },
  {
    "-2019/9/24-": "We will do year, month, day to avoid that argument. Although I would win"
  },
  {
    "-2019/9/24-": "Dont quote me on that"
  },
  {
    "-2019/9/24-": "Just be aware that the sunshine is at my discretion"
  },
  {
    "-2019/9/24-": "someone would come in asking for a missile guidance system, or maybe a spreadsheet system"
  },
  {
    "-2019/9/24-": "if you ever have to learn FORTRAN come to my office and we can cry together"
  },
  {
    "-2019/9/24-": "I can't trust myself. I have terrible impulse control"
  },
  {
    "-2019/9/24-": "It can live in the wilderness between everything"
  },
  {
    "-2019/9/24-": "Its a two way street. You pay for my time, but I expect to be the centre of attention"
  },
  {
    "-2019/9/24-": "That looks dangerous. I'm just going to turn my head the other way"
  },
  {
    "-2019/9/24-": "We can compute the area of a cylinder using (Gasp) C code"
  },
  {
    "-2019/9/24-": "If you lose marks on the midterm I want it to be because you don't know how to code. Don't take that out of context. Don't quote that."
  },
  {
    "-2019/9/24-": "It may seem daunting when I'm literally waving my hands while describing it"
  },
  {
    "-2019/9/24-": "When doing an exam you will forget to write your name"
  },
  {
    "-2019/9/24-": "I can read your mind, but I'm not allowed to while marking"
  },
  {
    "-2019/9/24-": "Even the parts that are hyperbole, we will do everything I say"
  },
  {
    "-2019/9/24-": "Whether or not I give a cruel question remains to be seen"
  },
  {
    "-2019/9/24-": "Unfortunately the fun isn't over"
  },
  {
    "-2019/9/26-": "What's in the box of chalk? It's gravel."
  },
  {
    "-2019/9/26-": "Somehow there is no chalk in this room with all these chalkboards"
  },
  {
    "-2019/9/26-": "Leaving the question blank is actually better than writing garbage"
  },
  {
    "-2019/9/26-": "There is a huge amount of power to the words 'I don't know'"
  },
  {
    "-2019/9/26-": "Not knowing something is a powerful place to be in"
  },
  {
    "-2019/9/26-": "I will post the exact size of this piece of paper in metric, just so we don't have disputes if someone brings a mural or something"
  },
  {
    "-2019/9/26-": "You get these horrible, ancient plywood desks"
  },
  {
    "-2019/9/26-": "You can print anything you want, it's technically your printing budget here"
  },
  {
    "-2019/9/26-": "I don't think the trees would be very happy though"
  },
  {
    "-2019/9/26-": "Do I look like Pope gregory?"
  },
  {
    "-2019/9/26-": "I look like a lot of people in stained glass windows"
  },
  {
    "-2019/9/26-": "The David STRONG building is named after, I know this will surprise some of you, David STRONG"
  },
  {
    "-2019/9/26-": "He's still around, I'm afraid his competing University isn't."
  },
  {
    "-2019/9/26-": "Anyone else want to, you know, SHIT ALL OVER MY VOCATION!?"
  },
  {
    "-2019/9/26-": "There's a building called HSD- Well, there's a place on campus called HSD that reports itself as  building"
  },
  {
    "-2019/9/26-": "My brain just stops at I don't like this thing, so its wrong"
  },
  {
    "-2019/9/26-": "Its not my fault that the calendar is stupid"
  },
  {
    "-2019/9/26-": "Lets see when the equal sign was invented"
  },
  {
    "-2019/9/26-": "I will tell you something, because I have to tell you something"
  },
  {
    "-2019/9/26-": "All the language are infected with this stupid precedent"
  },
  {
    "-2019/9/26-": "It can be typed or printed, or typed and printed for all I care"
  },
  {
    "-2019/9/26-": "The David Turpentine building is named after someone"
  },
  {
    "-2019/9/26-": "How dare you compare my darling C to that"
  },
  {
    "-2019/9/26-": "I develop specific pacing patterns"
  },
  {
    "-2019/9/26-": "Even the boards are being disagreeable"
  },
  {
    "-2019/9/26-": "If you want to talk about all the rooms, come to the office hours"
  },
  {
    "-2019/9/26-": "Somebody is looking up was HSD is"
  },
  {
    "-2019/9/26-": "We don't care what the value of A is, and you shouldn't remember that"
  },
  {
    "-2019/9/26-": "The C compiler whether on this or a dishwasher"
  },
  {
    "-2019/9/26-": "And that clock that's secretly digital"
  },
  {
    "-2019/9/26-": "Not only do we not know the number, we shouldn't try"
  },
  {
    "-2019/9/26-": "You've asked me to print something strange and mysterious, so I'll print the mysterious amulet"
  },
  {
    "-2019/9/26-": "I don't like my machine being happy"
  },
  {
    "-2019/9/26-": "Copy and paste to your heart's content"
  },
  {
    "-2019/9/26-": "I didn't spoil it in the other section. They are getting the A education"
  },
  {
    "-2019/9/26-": "You are going to go on and create a programming language, or an elevator to take out your anger upon the world. I mean that's why your in engineering"
  },
  {
    "-2019/9/26-": "Im going to ask again, and if I don't like the answer I will use linear algebra"
  },
  {
    "-2019/9/26-": "If it doesn't say you can't, you can"
  },
  {
    "-2019/9/26-": "I'm going to cannibalize this into the next example"
  },
  {
    "-2019/9/26-": "How does a keyboard work? I don't care"
  },
  {
    "-2019/9/26-": "I do actually have 2 minutes, and I will use it"
  },
  {
    "-2019/9/30-": "Be brave!... Nobody's brave."
  },
  {
    "-2019/9/30-": "What scope am I in? Oh yeah, zero"
  },
  {
    "-2019/9/30-": "Gotta be assertive"
  },
  {
    "-2019/9/30-": "Those of you who aren't stuck, bear with me. Maybe you can learn something too."
  },
  {
    "-2019/9/30-": "I'll lose my voice if I have to. I've done far worse"
  },
  {
    "-2019/9/30-": "The 116 people are used to me sounding like sandpaper"
  },
  {
    "-2019/9/30-": "The only thing that escapes the wreckage is the return value. So we destroy this!"
  },
  {
    "-2019/9/30-": "If you have to, bring a fat marker, and destroy that box!"
  },
  {
    "-2019/9/30-": "It's okay if you say yes. Nobody's saying yes."
  },
  {
    "-2019/9/30-": "Any questions at this point. Are we sure?"
  },
  {
    "-2019/9/30-": "I OBLITERATE THAT SCOPE, because I do not want that A and B to confuse me later"
  },
  {
    "-2019/9/30-": "Marks have type int. There are no half marks."
  },
  {
    "-2019/9/30-": "Numbers are meaningless, depending on the context"
  },
  {
    "-2019/9/30-": "WE THEN HAVE TO DESTROY IT"
  },
  {
    "-2019/9/30-": "We're all kind of restless now, thinking about that tracing example"
  },
  {
    "-2019/9/30-": "We're done responding again today"
  },
  {
    "-2019/9/30-": "You better be responding again by Thursday, otherwise you'll be giving the lecture"
  },
  {
    "-2019/9/30-": "We're even more restless now. Is that because we want to talk more about the and, or keep going?"
  },
  {
    "-2019/9/30-": "If only there was a way of expressing or in the clion language"
  },
  {
    "-2019/9/30-": "It's all about choices in a university like this"
  },
  {
    "-2019/9/30-": "I really like this diagram, I don't want to erase it"
  },
  {
    "-2019/9/30-": "If it's wrong, I will mark it down with extreme prejudice"
  },
  {
    "-2019/9/30-": "NO IT ISN'T."
  },
  {
    "-2019/9/30-": "I didn't want to ask, is it uppercase? I wanted to ask is it not uppercase"
  },
  {
    "-2019/10/1-": "YES! Let's celebrate our impending doom!"
  },
  {
    "-2019/10/1-": "I want to be able to write in permanent chalk"
  },
  {
    "-2019/10/1-": "If you have to be passive aggressive then I am SO PROUD OF YOU! congratulations you are going to be engineers!"
  },
  {
    "-2019/10/1-": "If you get it right you will get full marks for it, however, if you get it wrong, I will MARK DOWN EVERY SINGLE LITTLE MISTAKE! WE WILL PASS IT AROUND AND ALL MARK IT DOWN!"
  },
  {
    "-2019/10/1-": "But if you get it right, you will get it back with full marks and stains from my tears on it"
  },
  {
    "-2019/10/1-": "Never have role models in life, they'll let you down."
  },
  {
    "-2019/10/1-": "I sort of admire people that have like 5 backslashes"
  },
  {
    "-2019/10/1-": "SOMETIMES I JUST CRY INTO MY AVOCADO TOAST"
  },
  {
    "-2019/10/1-": "If I had my way... well I mean I get my way... If logistics allowed it"
  },
  {
    "-2019/10/1-": "Im not yet at the point where my automations are that smart"
  },
  {
    "-2019/10/1-": "Their question was, and yes this was their question This doesn't look anything like the practice exam!"
  },
  {
    "-2019/10/1-": "Im sorry that you will get an extra long thanksgiving weekend"
  },
  {
    "-2019/10/1-": "Im very envious of the linear algebra instructor, and their writing being impossible to erase"
  },
  {
    "-2019/10/1-": "I think I'll have to sneak in to one of the lectures"
  },
  {
    "-2019/10/1-": "I might have to disguise myself"
  },
  {
    "-2019/10/1-": "I get asked where I would write that. I would write that on the board, but you would not."
  },
  {
    "-2019/10/1-": "Are we excited to call g? well I mean obviously"
  },
  {
    "-2019/10/1-": "I love seeing those, especially if its passive aggressive"
  },
  {
    "-2019/10/1-": "Do you need a calculator for this? Well too bad, there are no calculators on the exam."
  },
  {
    "-2019/10/1-": "You have enough time to draw the diagram on the midterm, so do that"
  },
  {
    "-2019/10/1-": "This took me 30 minutes, but that was mostly explanation and theatrics, neither of which are allowed on the exam."
  },
  {
    "-2019/10/1-": "Ive been flipping heads for years now, but sometimes I bet on tails just to throw people off"
  },
  {
    "-2019/10/1-": "Good programmers write code with bugs in it"
  },
  {
    "-2019/10/1-": "If you know some of the stranger or more esoteric parts of C you may use it"
  },
  {
    "-2019/10/1-": "If only there was a way to ask this as one big question. WAIT! THERE IS!?"
  },
  {
    "-2019/10/1-": "We don't have an OR-persand, well maybe, I don't know what this is called."
  },
  {
    "-2019/10/1-": "People are leaning over and comparing number of backslashes"
  },
  {
    "-2019/10/1-": "You should practice drawing your ampersand in this class"
  },
  {
    "-2019/10/1-": "You should demand an explanation, set the bar high"
  },
  {
    "-2019/10/1-": "From what I've read about gen Z I expected you to be better at demanding stuff"
  },
  {
    "-2019/10/1-": "A bitwise operation relates to binary, which relates to bits"
  },
  {
    "-2019/10/1-": "The guy who teaches it is Fun, literally that's his name. If he makes that joke, I've ruined it for him."
  },
  {
    "-2019/10/3-": "You can choose to lose the style mark, that's fine, that's your choice. You can also choose not to hand that assignment in, that's completely valid, it's completely your choice"
  },
  {
    "-2019/10/3-": "This is where I say 'yeah ok', then I hand out a midterm"
  },
  {
    "-2019/10/3-": "THIS IS ABSOLUTELY AWFUL. This is something that will get you laughed out of a programming job."
  },
  {
    "-2019/10/3-": "If you do this on an assignment, we reserve the right to use EXTREME VENGEANCE on you"
  },
  {
    "-2019/10/3-": "CHOOSE NOT TO USE THE METAL SCISSORS. Admitting is the first step"
  },
  {
    "-2019/10/3-": "This isn't first grade. You're not gluing macaroni to construction paper. If you glue all your fingers together, that's the first step."
  },
  {
    "-2019/10/3-": "This is opening up pandora's box."
  },
  {
    "-2019/10/3-": "Maybe you're working for a company that uses C code (with goto), and you can send them to me."
  },
  {
    "-2019/10/3-": "This is a feature you can use, but YOU SHOULDN'T USE IT CAUSE IT'S BAD."
  },
  {
    "-2019/10/3-": "This is something you shouldn't know. Even people who teach C don't want you to know this."
  },
  {
    "-2019/10/3-": "This code is non-canonical. This time is considered not to have passed."
  },
  {
    "-2019/10/3-": "I'm already in the next part of the course in my head."
  },
  {
    "-2019/10/3-": "We realize it's good to be a tourist, to see the sights, but there are places to go (namely Australia) where EVERYTHING TRIES TO KILL YOU. Watch out for spiders that take up the whole road or whatever."
  },
  {
    "-2019/10/3-": "Do you know about goto statements?"
  },
  {
    "-2019/10/3-": "No, that's the opposite of what I wanted! None of this ever happened! This time didn't exist!"
  },
  {
    "-2019/10/3-": "I've got to erase this word the last instructor must have left on the board. Oh, and this diagram too."
  },
  {
    "-2019/10/3-": "The reason it takes an int is because... well, never mind."
  },
  {
    "-2019/10/3-": "We're gonna put this down here in its on little box with the comma"
  },
  {
    "-2019/10/3-": "Someone said yes. Have fun on the midterm!"
  },
  {
    "-2019/10/3-": "We have dishwashers now, and people shouldn't be slapping their kids"
  },
  {
    "-2019/10/3-": "HOW EXCITED ARE WE TO LEARN ABOUT WHATEVER'S GOING ON THERE"
  },
  {
    "-2019/10/3-": "'Member selection via a...' oh, but then there's that word"
  },
  {
    "-2019/10/3-": "UUUUUUUUGH"
  },
  {
    "-2019/10/3-": "Then there's sizeof... whatever that means"
  },
  {
    "-2019/10/3-": "The other lecture is like 3 lectures ahead because of all the time we spend on applause"
  },
  {
    "-2019/10/3-": "Today and tomorrow are part of this week"
  },
  {
    "-2019/10/3-": "We're in midterm mode now"
  },
  {
    "-2019/10/3-": "This is bad style.c Is anybody going to use any of this? probably"
  },
  {
    "-2019/10/3-": "Maybe I was using 15 at some point at some time"
  },
  {
    "-2019/10/3-": "Are you following the style guidelines of society"
  },
  {
    "-2019/10/3-": "One option A VERY BAD IDEA, is to put it out in the wilderness"
  },
  {
    "-2019/10/3-": "There is a milkshake in ECS right now"
  },
  {
    "-2019/10/3-": "Do you know how hard it is to not drink half a milkshake?"
  },
  {
    "-2019/10/3-": "Whats goto why'd you ask that, where did you hear about it!?"
  },
  {
    "-2019/10/3-": "We will see some dark arts features of C"
  },
  {
    "-2019/10/3-": "Im talking about it, but I won't remember talking about it"
  },
  {
    "-2019/10/3-": "I don't know why we are talking so much about driving"
  },
  {
    "-2019/10/3-": "The courses in this university assume you are not evil"
  },
  {
    "-2019/10/3-": "If this wasn't run like this, it would run until the end of time, and I would like to stop paying tuition before then"
  },
  {
    "-2019/10/3-": "Would anyone like some life advice as a follow up to that question?"
  },
  {
    "-2019/10/3-": "I keep wondering why there is no chalk, I guess I'm destroying it all"
  },
  {
    "-2019/10/3-": "Thankfully someone else did it for us"
  },
  {
    "-2019/10/3-": "I chose this one because I liked the typeface"
  },
  {
    "-2019/10/3-": "I don't know my blocking"
  },
  {
    "-2019/10/3-": "Can you yell at me next time?"
  },
  {
    "-2019/10/3-": "For your sake I won't, but I could"
  },
  {
    "-2019/10/3-": "We keep hearing the name, meaning its obviously the final boss"
  },
  {
    "-2019/10/3-": "That's a good question theoretical student"
  },
  {
    "-2019/10/7-": "Does anybody think I'm a hypocrite?"
  },
  {
    "-2019/10/7-": "Is 6 less than 10?"
  },
  {
    "-2019/10/7-": "That was less enthusiastic than I had hoped. Check into that before the exam."
  },
  {
    "-2019/10/7-": "People don't seem to appreciate the L-value"
  },
  {
    "-2019/10/7-": "Two other people have come up with questions and then changed their mind"
  },
  {
    "-2019/10/7-": "The question is, why are we putting assignments inside assignment statements? The answer for now, is it makes a good midterm question."
  },
  {
    "-2019/10/7-": "...this huge list of strange assignment operators and their friends..."
  },
  {
    "-2019/10/7-": "What is going on with this comma operator?"
  },
  {
    "-2019/10/7-": "Now, the question you might ask is WHY? I don't really know the answer."
  },
  {
    "-2019/10/7-": "Anyone want to be a smartass on an exam question?"
  },
  {
    "-2019/10/7-": "The word hideous is one sign we may want to avoid it"
  },
  {
    "-2019/10/7-": "We'd rather not screw around with strange expressions if we can avoid it"
  },
  {
    "-2019/10/7-": "Oh great, because it's valid, I've got to figure out what it does"
  },
  {
    "-2019/10/7-": "I already think we're having enough fun with the single comma"
  },
  {
    "-2019/10/7-": "10 plus 1 is apparently not 7"
  },
  {
    "-2019/10/7-": "It's ok, especially at this point in the course, to wait to point it out until I embarrassed myself"
  },
  {
    "-2019/10/7-": "We are disquieted, so I achieved that goal!"
  },
  {
    "-2019/10/7-": "Are we disquieted in a way that's a question, or are we just generally making noise?"
  },
  {
    "-2019/10/7-": "On the midterm, will you complain if you're asked to do this math?"
  },
  {
    "-2019/10/7-": "Why would I do it? Because I'm being sadistic and teaching a programming course."
  },
  {
    "-2019/10/7-": "Those are all interesting ways for building character"
  },
  {
    "-2019/10/7-": "It's gross! There we go."
  },
  {
    "-2019/10/7-": "Hey, it's even better if you delete all the spaces between"
  },
  {
    "-2019/10/7-": "Sorry about the slanting. It's a structural integrity issue on that end of the equation"
  },
  {
    "-2019/10/7-": "It's a question of how much you want torture me, basically"
  },
  {
    "-2019/10/8-": "I gotta apologize if my voice isn't as rich and Sensual as usual"
  },
  {
    "-2019/10/8-": "Nothing I assume will bring your spirits down, but I assume after the midterm the awkward clapping will be fainter"
  },
  {
    "-2019/10/8-": "Like five people will come up to the front because they forgot a pen, There will be one. One singular pen for everyone to share"
  },
  {
    "-2019/10/8-": "At this point I've completed my bucket list of weird shit I've seen"
  },
  {
    "-2019/10/8-": "If you can still get carbon paper now. I would like to get some"
  },
  {
    "-2019/10/8-": "I advise that all this time you spent scheming, you just learn programming"
  },
  {
    "-2019/10/8-": "An abacus is an external device, and we reserve the right to confiscate it at our leisure"
  },
  {
    "-2019/10/8-": "This particular topic is especially not on the midterm"
  },
  {
    "-2019/10/8-": "This doesn't capture your heart's like carbon paper"
  },
  {
    "-2019/10/8-": "There are courses you can take on how to use carbon paper"
  },
  {
    "-2019/10/8-": "We have the whole zoo of logical operators"
  },
  {
    "-2019/10/8-": "We need to work on your hollering"
  },
  {
    "-2019/10/8-": "I often put questions like this on the final or midterm. Frankly its an easy way to take attendance"
  },
  {
    "-2019/10/8-": "People have brought that one up to me ranging from diplomatically, to not at all diplomatically"
  },
  {
    "-2019/10/8-": "For now the reason we know it is so it can be asked on sadistic midterm questions"
  },
  {
    "-2019/10/8-": "You should practice questions using plus plus AND plus plus"
  },
  {
    "-2019/10/8-": "People would get impatient with me spending 40 minutes talking about binary in a course that doesn't require binary"
  },
  {
    "-2019/10/8-": "Creating a macro on the midterm is only for smartasses, which I encourage, but maybe get the question right first"
  },
  {
    "-2019/10/8-": "We are clearly running out of collective patience"
  },
  {
    "-2019/10/8-": "Its invalid, whatever that's supposed to mean"
  },
  {
    "-2019/10/8-": "See you on the midterm. Good luck on the midterm. Please show up for the midterm. Don't forget to write your name on the midterm."
  },
  {
    "-2019/10/17-": "Was the midterm easy? NO, IT WAS TOUGH, IT WAS HARD"
  },
  {
    "-2019/10/17-": "Think of how that midterm would have went on September 1st"
  },
  {
    "-2019/10/17-": "You're off Monday, Tuesday, Wednesday... the midterm is Thursday."
  },
  {
    "-2019/10/17-": "Don't worry about it, the instructor evaluation is the week after"
  },
  {
    "-2019/10/17-": "The key is just having a lot of people working on it"
  },
  {
    "-2019/10/17-": "We all just wanted to go home and have thanksgiving"
  },
  {
    "-2019/10/17-": "The midterm average was just fine"
  },
  {
    "-2019/10/17-": "The midterms are on my desk in ECS 255, right next to the copy of midterm 2. Is it a good idea to give this respectable student my keys?"
  },
  {
    "-2019/10/17-": "I vaguely remember a talk HR gave me about privacy..."
  },
  {
    "-2019/10/17-": "If you're going to go into the master grading spreadsheet, don't give everybody hundreds, you should instead lower everyone else's mark so it gets scaled at the end of the course"
  },
  {
    "-2019/10/17-": "I wouldn't expect it from you, that's why you're the most trusted student"
  },
  {
    "-2019/10/17-": "It's the other 149 people with their water bottles that I'd be more worried about"
  },
  {
    "-2019/10/17-": "A VERY STRANGE, ODD, PHILOSOPHICAL SIGH. IT'S NOT LIKE THIS WILL BECOME RELEVANT AGAIN IN 20 MINUTES OR SOMETHING?"
  },
  {
    "-2019/10/17-": "Lectures seem to always go the way I want them to"
  },
  {
    "-2019/10/17-": "Now that I've said that, I'll faceplant in 5 minutes or something"
  },
  {
    "-2019/10/17-": "I want to write a function that returns 3 things, can I do that? Well, first off can I write a function that returns 1 thing? Someone said no, but the answer is of course yes"
  },
  {
    "-2019/10/17-": "The idea is that now we have to begin pulling out a bunch of strange features that do specialized tasks"
  },
  {
    "-2019/10/17-": "Obviously you will need midterm 1 stuff for midterm 2 and the final exam"
  },
  {
    "-2019/10/17-": "Getting perfect would be great, certainly, but getting less than perfect is just fine"
  },
  {
    "-2019/10/17-": "I'll be marking on Christmas Eve or whatever"
  },
  {
    "-2019/10/17-": "The whole system is locked down carefully to avoid politics, which I am very good at"
  },
  {
    "-2019/10/17-": "I can't do anything about that, call the airline"
  },
  {
    "-2019/10/17-": "That way I mark it in a vacuum"
  },
  {
    "-2019/10/17-": "The midterm was conspicuously missing two types of questions. The two types were a nasty nested loops question, and the second was a really, and I mean really nasty tracing question"
  },
  {
    "-2019/10/17-": "It must be possible in c to store a bank of numbers"
  },
  {
    "-2019/10/17-": "That's weird, it did come up again. Strange."
  },
  {
    "-2019/10/17-": "There is a filing cabinet full of old records of everybody that's ever gone to UVic."
  },
  {
    "-2019/10/17-": "I don't want to go photocopy every student record"
  },
  {
    "-2019/10/17-": "It's a pointer."
  },
  {
    "-2019/10/17-": "I asked her, why is it that you teach first year students Java and not C? Her response was pointers."
  },
  {
    "-2019/10/17-": "We teach Java to first year CSC students because Java doesn't have points."
  },
  {
    "-2019/10/17-": "Computer science students are scared because of pointers, and we don't want to scare away computer science students"
  },
  {
    "-2019/10/17-": "Java is full of pointers. It just tries to pretend that they don't exist."
  },
  {
    "-2019/10/17-": "I've already told you, 'this is scary'"
  },
  {
    "-2019/10/17-": "If we know how to handle these things, they're not that bad"
  },
  {
    "-2019/10/17-": "These diagrams are going to get tangled up really quickly"
  },
  {
    "-2019/10/17-": "How do I help 111 students to pass pointer questions?"
  },
  {
    "-2019/10/17-": "We need to talk about the taxonomy of typing"
  },
  {
    "-2019/10/17-": "The moment you see that in the problem, YOU DRAW THE ENTIRE DIAGRAM."
  },
  {
    "-2019/10/17-": "DO WE BELIEVE IT"
  },
  {
    "-2019/10/17-": "This is like pulling teeth. I'm going to be pulling a lot of teeth today if that's the case."
  },
  {
    "-2019/10/17-": "Float star"
  },
  {
    "-2019/10/17-": "It's very ominous. I'll show it at the end of this lecture"
  },
  {
    "-2019/10/17-": "We're in very little of a mood for this, are we"
  },
  {
    "-2019/10/17-": "I am allowed to create a pointer to ANY TYPE. That's going to come back to bite us, but ANY TYPE."
  },
  {
    "-2019/10/17-": "Anyone notice a strange chill pass across the room?"
  },
  {
    "-2019/10/17-": "It's reassuring that we can't do this particular thing, but there's some stuff there that is a bit worrying"
  },
  {
    "-2019/10/17-": "I'm going to start centrally collecting the erasers cause they're never where I want them to be."
  },
  {
    "-2019/10/17-": "Could I make a pointer that points at a pointer?"
  },
  {
    "-2019/10/17-": "Task 8: Scroll way down for dramatic effect"
  },
  {
    "-2019/10/17-": "We've hovering above the ground"
  },
  {
    "-2019/10/17-": "I think we're going to talk about pointers on Monday"
  },
  {
    "-2019/10/17-": "Your name is Bird, therefore you are allergic to chicken!!"
  },
  {
    "-2019/10/17-": "Well we've got all this spaghetti here!"
  },
  {
    "-2019/10/17-": "My mind starts going to very dark places, I draw a very large box."
  },
  {
    "-2019/10/17-": "It exfoliates my throat"
  },
  {
    "-2019/10/17-": "If you have a problem with the eraser situation, go vote next week."
  },
  {
    "-2019/10/17-": "I'm personally Pro Eraser"
  },
  {
    "-2019/10/17-": "Can somebody close the doors? The people in the lobby won't understand the whole applause thing, and we don't want to give them ideas"
  },
  {
    "-2019/10/17-": "The median was also just fine"
  },
  {
    "-2019/10/17-": "Anyone want to run to ECS 255? You will have to miss 10 minutes of me talking, which I know for some of you would be a travesty"
  },
  {
    "-2019/10/17-": "The answer to how I marked them so fast, was because I wanted a thanksgiving weekend too"
  },
  {
    "-2019/10/17-": "If you remember someone bought $999 at a chicken restaurant, but if they knew me that would have been super mean because I'm allergic to chicken"
  },
  {
    "-2019/10/17-": "Surely there is no way that this will matter in 10 minutes"
  },
  {
    "-2019/10/17-": "I guess we need to start programming eventually. Any more questions?"
  },
  {
    "-2019/10/17-": "If you come to my office, we can talk about it all you you want, but I don't have them, so I can make it up I guess"
  },
  {
    "-2019/10/17-": "Ive started filling this with a clear liquid. Maybe it helps"
  },
  {
    "-2019/10/17-": "It doesn't matter how long ago they were made, travel plans do not count as an illness"
  },
  {
    "-2019/10/17-": "This is still the same class from 2 weeks ago. You still have to talk, not just applaud"
  },
  {
    "-2019/10/17-": "I gave it a photocopy. It destroyed it. I don't care"
  },
  {
    "-2019/10/17-": "One of the things is that engineering students have a higher tolerance for pain"
  },
  {
    "-2019/10/17-": "If I give you access, like the problem from 20 minutes ago"
  },
  {
    "-2019/10/17-": "This is notation hell"
  },
  {
    "-2019/10/17-": "Your not inherently stupid, if you were you wouldn't be here"
  },
  {
    "-2019/10/17-": "Im going to erase this later, just to draw it again"
  },
  {
    "-2019/10/17-": "Every time you read the word * "
  },
  {
    "-2019/10/17-": "Im going to keep asking, and you will need to keep responding"
  },
  {
    "-2019/10/17-": "Which has Kevin Spacey in it, which is bad because now he is bad"
  },
  {
    "-2019/10/17-": "My erasers have accumulated"
  },
  {
    "-2019/10/17-": "Yeah... we are all about done with this, unfortunately we are not done with THIS"
  },
  {
    "-2019/10/17-": "This is about the point where people thought the nightmare was over, but this is where you just started to fall asleep"
  },
  {
    "-2019/10/17-": "The reason you are groaning is not because I can do that, but because you see that I could make int*** but lucky for you, because of making this box way too large, there isn't enough room"
  },
  {
    "-2019/10/17-": "I can add stars up to the limit of the compiler seeing stars"
  },
  {
    "-2019/10/17-": "If on a question I don't say you have to do something, you don't have to do it"
  },
  {
    "-2019/10/17-": "Ok, so I have my eraser collection over here"
  },
  {
    "-2019/10/17-": "I have my one last eraser here"
  },
  {
    "-2019/10/21-": "Don't want any thinking happening"
  },
  {
    "-2019/10/21-": "IF ANYONE HAS NOT GONE AND VOTED, GO VOTE!"
  },
  {
    "-2019/10/21-": "You can take 111 three more times before the next election"
  },
  {
    "-2019/10/21-": "It flatters me that you're taking pictures"
  },
  {
    "-2019/10/21-": "I hope I'm in all of them"
  },
  {
    "-2019/10/21-": "How are we all doing in Math 110?"
  },
  {
    "-2019/10/21-": "Your assignment requires some basic linear algebra stuff. You'll be fine! You'll be fine!"
  },
  {
    "-2019/10/21-": "How are you all liking matrix multiplication?"
  },
  {
    "-2019/10/21-": "Are we angle bracket or round bracket people for vectors?"
  },
  {
    "-2019/10/21-": "I asked if you wanted to think about pointers, and you didn't want to!"
  },
  {
    "-2019/10/21-": "Computing a dot product isn't scary. Is matrix multiplication scary?"
  },
  {
    "-2019/10/21-": "We've got a turnout of about 5%"
  },
  {
    "-2019/10/21-": "ALL I CAN HOPE FOR IS THE OTHER 95% AT LEAST GO VOTE IN THE ELECTIONS."
  },
  {
    "-2019/10/21-": "Yeah I can do whatever I want, but can you do it?"
  },
  {
    "-2019/10/21-": "There's this strange thing they call in the fine arts department NEGATIVE SPACE there"
  },
  {
    "-2019/10/21-": "FIGURE OUT A WAY OF DRAWING A DIAGRAM, AND LET THE DIAGRAM DO THE WORK FOR YOU"
  },
  {
    "-2019/10/21-": "That's because it's a recycled example from a long time ago"
  },
  {
    "-2019/10/21-": "What does it mean for the program to crash? Hmm, we'll think about that..."
  },
  {
    "-2019/10/21-": "Welcome to Victoria, here's your septum piercing and a six pack of IPA"
  },
  {
    "-2019/10/22-": "Now realize time you spend on applause is time I don’t spend talking, and the only thing I like more than the sound of applause is the sound of my voice, so your constant applause is the worst form of torture"
  },
  {
    "-2019/10/22-": "If your mark was higher because we added it up wrong, maybe you forget to tell us or something"
  },
  {
    "-2019/10/22-": "Not liking your mark is not an error"
  },
  {
    "-2019/10/22-": "If you only had to make it compile for marks, you could just write hello world for every question"
  },
  {
    "-2019/10/22-": "Our lecture is like 10 minutes shorter for applause"
  },
  {
    "-2019/10/22-": "What is slow?"
  },
  {
    "-2019/10/22-": "We are coming to a point, and by that I mean Thursday"
  },
  {
    "-2019/10/22-": "It looks like I made a table here inadvertently"
  },
  {
    "-2019/10/22-": "The answer is that the C standard library hasn't figured itself out"
  },
  {
    "-2019/10/22-": "I didn't mean to make this point in yesterday's lecture"
  },
  {
    "-2019/10/22-": "Does anybody want a multiple choice exam from me?"
  },
  {
    "-2019/10/22-": "I would just make all the answers B, or something like that"
  },
  {
    "-2019/10/22-": "I'm never allowed to break into someone else's scope. It is their personal property"
  },
  {
    "-2019/10/22-": "Without a definitive response, we will try to push on"
  },
  {
    "-2019/10/22-": "Everyone else is favouring for general muttering"
  },
  {
    "-2019/10/22-": "The muttering better not be people remembering that they didn't vote"
  },
  {
    "-2019/10/22-": "We've got this and we are going to change it, me and the two people here today"
  },
  {
    "-2019/10/22-": "I think we lost some people on step 1, Some of the two people, half the class."
  },
  {
    "-2019/10/22-": "If you look at this and think that's obvious, great, don't do that"
  },
  {
    "-2019/10/22-": "I'll have all of Thursday, next Tuesday, and next Thursday to pontificate about linear algebra"
  },
  {
    "-2019/10/22-": "There is a typical axiom of don't do math in public"
  },
  {
    "-2019/10/22-": "For people in math 110, this is review. For people not in it, you get to learn math today"
  },
  {
    "-2019/10/22-": "We've got something here that those in the art department would call negative space. It looks suspiciously like a matrix"
  },
  {
    "-2019/10/22-": "I have to draw two lines then pontificate"
  },
  {
    "-2019/10/22-": "That is one right of passage that I can't let you escape from"
  },
  {
    "-2019/10/22-": "With determinants all you can hope for is that your matrices stay small"
  },
  {
    "-2019/10/22-": "600 should be self explanatory"
  },
  {
    "-2019/10/22-": "If I did this without a diagram, I would probably make a mistake, but I would not make the mistake of doing this question without a diagram"
  },
  {
    "-2019/10/22-": "I'm not sure I believe the apathy in here"
  },
  {
    "-2019/10/22-": "This task is the easy mode version of a task that will follow us to the end of the course"
  },
  {
    "-2019/10/22-": "Your all staying a minute due to all the applause"
  },
  {
    "-2019/10/22-": "During the really long applause, I went on my phone and cancelled all my plans. I can be here all night"
  },
  {
    "-2019/10/24-": "This is the test section. You get all the garbage, and I refine it for the second section."
  },
  {
    "-2019/10/24-": "Well, all of you are in CSC 111"
  },
  {
    "-2019/10/24-": "My operating system, your operating system, and all of your smart devices, operate on C."
  },
  {
    "-2019/10/24-": "Anyone else want to get a question in before I write more than 8 characters?"
  },
  {
    "-2019/10/24-": "I'm hoping by the end of the course we get one question per character"
  },
  {
    "-2019/10/24-": "I know how to get back to ECS somehow, I just don't know how"
  },
  {
    "-2019/10/24-": "You're the serious, professional session, who just grumbles at me to move on"
  },
  {
    "-2019/10/24-": "The other session, I don't know if it's because they're at 4:30 or because they're in the Hickman building, has decided that the best way to hold my attention is spurious rounds of applause"
  },
  {
    "-2019/10/24-": "This is the place where the other session would start applauding or leaving to try to get me to shut up."
  },
  {
    "-2019/10/24-": "I just have to write A sub 0. So let me go over to my laptop, and type A, and then try to switch my keyboard to type that font"
  },
  {
    "-2019/10/24-": "Have you noticed the problem? This is a premium laptop, I can't believe it doesn't have the ability to type all characters!"
  },
  {
    "-2019/10/24-": "Yes, and you'll have a lot of fun thinking about that concept when you take a look at practice midterm number 2"
  },
  {
    "-2019/10/24-": "We've opened up a bunch of doors, and our brains are getting drafty"
  },
  {
    "-2019/10/24-": "Well, I'm not going to now, because you ruined it"
  },
  {
    "-2019/10/24-": "It was my mistake of telling you that it was a clever measure of torturing me"
  },
  {
    "-2019/10/24-": "Engineers have a habit of figuring these things out"
  },
  {
    "-2019/10/24-": "People in the afternoon's section don't have that advantage, and they're burning at this point 25 minutes of the lecture with applause"
  },
  {
    "-2019/10/24-": "I don't mind encouraging the sensible, professional behaviour"
  },
  {
    "-2019/10/24-": "There's obviously something wrong here. These aren't the correct values."
  },
  {
    "-2019/10/24-": "Ah, there's Bill Bird again, teaching 111 arrays again"
  },
  {
    "-2019/10/24-": "And the analogy still holds! I walk 1 million steps that way. Where do I end up? Depends on my stride"
  },
  {
    "-2019/10/24-": "I might end up in the ocean, in which case I'm not very good at swimming, and am never heard of again."
  },
  {
    "-2019/10/24-": "If you screw around with someone else's stuff, they call the police"
  },
  {
    "-2019/10/24-": "Again, it's a totalitarian state. They terminate on sight."
  },
  {
    "-2019/10/24-": "HOLD ON TWO MINUTES, I STILL HAVE ANOTHER TWO MINUTES"
  },
  {
    "-2019/10/24-": "It's unnerving that you can go so far off and still be fine. It's better if it's just terminated"
  },
  {
    "-2019/10/24-": "Now you get to practice walking into other rooms on campus"
  },
  {
    "-2019/10/24-": "I mentioned before that the same stuff is on the exam no matter how much vacuous applause"
  },
  {
    "-2019/10/24-": "I'm just going to have to not say anything interesting"
  },
  {
    "-2019/10/24-": "At this point in the semester you don't want to do anything"
  },
  {
    "-2019/10/24-": "This is a review of five minutes ago"
  },
  {
    "-2019/10/24-": "They do it this way because they think its cool to call it S not"
  },
  {
    "-2019/10/24-": "It doesn't not sound reasonable? That's reasonable"
  },
  {
    "-2019/10/24-": "I need a semi colon before we try that"
  },
  {
    "-2019/10/24-": "I really really want to answer that, but people with a Monday lab would never forgive me"
  },
  {
    "-2019/10/24-": "That's a good question, a good question for a Tuesday"
  },
  {
    "-2019/10/24-": "I always have time for linear algebra, but not today"
  },
  {
    "-2019/10/24-": "Those Monday lab people really scare me"
  },
  {
    "-2019/10/24-": "My computer is too hygienic"
  },
  {
    "-2019/10/24-": "One thing you don't have to imagine is the marks you will lose on assignment six and seven"
  },
  {
    "-2019/10/24-": "That's not a number, its an L"
  },
  {
    "-2019/10/24-": "Many user's don't know C programming. Many C programmers don't know C programming either"
  },
  {
    "-2019/10/24-": "The problem with making engineers use iclickers is that you go from a room of people with iclickers, to just one person with a duffel bag of iclickers"
  },
  {
    "-2019/10/24-": "I extrude this out and I have a cube of data, which is really weird"
  },
  {
    "-2019/10/24-": "Its the first day, and this weird guy is up there drinking chocolate milk"
  },
  {
    "-2019/10/24-": "All I want is a medical excuse to drink something sugary"
  },
  {
    "-2019/10/24-": "We probably know we are up to no good if there is a comma in there"
  },
  {
    "-2019/10/24-": "Its the good kind of plagiarism"
  },
  {
    "-2019/10/24-": "Please find something in your academic career to cite 'Personal Communication'"
  },
  {
    "-2019/10/24-": "We have 11 minutes, which in A01 & A02 time, with you wanting to leave 5 minutes early, and the 4 minutes you will spend on applause, means we have 2 minutes"
  },
  {
    "-2019/10/24-": "You shouldn't trust them, users don't tend to follow instructions"
  },
  {
    "-2019/10/24-": "Do what you want. Try what you want. Try not to get lost at sea"
  },
  {
    "-2019/10/24-": "They will call the police and say 'there goes bill teaching arrays again'"
  },
  {
    "-2019/10/24-": "You can tell its totalitarian because it's got this Orwellian 'SIGNAL 11'"
  },
  {
    "-2019/10/24-": "I can be half way across campus before someone has the decency to call the police"
  },
  {
    "-2019/10/28-": "I try not to visualize 3-dimensional arrays"
  },
  {
    "-2019/10/28-": "It didn't give me a warning or anything. It just let me get away with it."
  },
  {
    "-2019/10/28-": "Is anyone preparing to be sad because we can't do that?"
  },
  {
    "-2019/10/28-": "Maybe you'll learn data mining or something from this"
  },
  {
    "-2019/10/28-": "Remember this a few years from now. Maybe the machines will have taken over by then"
  },
  {
    "-2019/10/28-": "If we're not careful, we're going to make the mistake this is trying to induce"
  },
  {
    "-2019/10/28-": "If we're doing this in our head, I will make this mistake"
  },
  {
    "-2019/10/28-": "What do we think of that?... mumbling of various assorts"
  },
  {
    "-2019/10/28-": "Today you're probably less disquieted because I told you all to be quiet earlier"
  },
  {
    "-2019/10/28-": "It's ok to be disquieted about pointers, but just keep quiet enough so you can hear me"
  },
  {
    "-2019/10/28-": "What do we think of that? Epic? I was hoping for unsettling, but we'll take epic for the midterm"
  },
  {
    "-2019/10/28-": "You should look forward to seeing one of these on the exam"
  },
  {
    "-2019/10/28-": "Can I make arrays of size zero?.... yes, yes I can. What's the first index of an array of size zero?... eeeeugh, it's undefined."
  },
  {
    "-2019/10/28-": "Does it hurt the computer to allocate the array?"
  },
  {
    "-2019/10/28-": "In c++ you have complete freedom to be an ass."
  },
  {
    "-2019/10/28-": "On a midterm you can do whatever you want, its called free will but when I get the midterm I can do whatever I want, its called free bill"
  },
  {
    "-2019/10/29-": "Its a first year lecture, so if you want to sleep this is the time"
  },
  {
    "-2019/10/29-": "They say to use your rage to be productive, so I use my rage to add a new question to the midterm every time. We had to order more paper from another province because of the size of the midterm"
  },
  {
    "-2019/10/29-": "maybe this is an easy course. We will leave that for the midterm that's 400 pages a piece"
  },
  {
    "-2019/10/29-": "The question is if there is a way, and you know because I'm asking the answer is obviously"
  },
  {
    "-2019/10/29-": "I like to imagine I'm on a TV show ... Like Mr. Rogers, which has been off the air since most of you were born, because I'm old"
  },
  {
    "-2019/10/29-": "There is plenty of time to sob in my office after 6"
  },
  {
    "-2019/10/29-": "Where is my stool?"
  },
  {
    "-2019/10/29-": "That side is whatever, they are reading chemistry notes or something"
  },
  {
    "-2019/10/29-": "Whats wrong with this? its just water"
  },
  {
    "-2019/10/29-": "Any questions? 'why?' y is 100"
  },
  {
    "-2019/10/29-": "You are allowed to embrace this fiction"
  },
  {
    "-2019/10/29-": "Its called the centipede dilemma. Ask a centipede how it walks, or for a more human example, let me ask you how you are manually breathing right now"
  },
  {
    "-2019/10/29-": "Here is a bucket of nothing. Whats the largest thing in it?"
  },
  {
    "-2019/10/29-": "7 is the obvious answer, but lets not convince everyone else that that's true"
  },
  {
    "-2019/10/29-": "Those two words 'worst case' will come to haunt you in later courses"
  },
  {
    "-2019/10/30-": "We can solve this with the power of friendship"
  },
  {
    "-2019/10/30-": "Just like in real life, you can make friends to give them access to your private members"
  },
  {
    "-2019/10/31-": "It doesn't give the recipe for any of the dishes or whatever"
  },
  {
    "-2019/10/31-": "I'm going to hydrate some more. My voice is already getting scratchy"
  },
  {
    "-2019/10/31-": "printf is a function call as we saw on the midterm. Maybe we don't want to think about it if we got that question wrong."
  },
  {
    "-2019/10/31-": "I've made no effort to give you code that screws you over"
  },
  {
    "-2019/10/31-": "A bunch of people suddenly looked up when I said mercy. THAT'S RIGHT, NO MERCY!"
  },
  {
    "-2019/10/31-": "It's not as scary as most pointer things, it's just odd"
  },
  {
    "-2019/10/31-": "I didn't actually check, people shouted it out and I believed them"
  },
  {
    "-2019/10/31-": "Even on halloween, it's a bit too scary to talk about it"
  },
  {
    "-2019/10/31-": "EVEN IF IT'S ME SAYING IT, because I said so is not a good reason"
  },
  {
    "-2019/10/31-": "Maybe I just said so in a very convincing way, I don't know"
  },
  {
    "-2019/10/31-": "I just said we don't return arrays, so we DON'T return arrays."
  },
  {
    "-2019/10/31-": "What's going to happen when I do this? SOMETHING REALLY BAD. Maybe another function exists there and we mess with it. Maybe it's sunken underwater by now"
  },
  {
    "-2019/10/31-": "IF YOU WRITE THIS DOWN I'M GOING TO MARK IT DOWN SO HARD!"
  },
  {
    "-2019/10/31-": "WHICH IT DOESN'T, IT'S BAD, DON'T DO IT!"
  },
  {
    "-2019/10/31-": "This is a bad idea, DON'T DO IT!"
  },
  {
    "-2019/10/31-": "I literally don't know what will happen when I run this."
  },
  {
    "-2019/10/31-": "Linux is very authoritarian. It just goes in and kills it and doesn't care about its work ethic."
  },
  {
    "-2019/10/31-": "On Windows, it would pop up that box that says 'This program is not responding'."
  },
  {
    "-2019/10/31-": "Will good things happen? NO. ABSOLUTELY NOT"
  },
  {
    "-2019/10/31-": "What if F has the ability to conjure up arrays out in the ether?"
  },
  {
    "-2019/10/31-": "Late november is a time to ponder about existentially spooky things"
  },
  {
    "-2019/10/31-": "About half of you, and you just didn't put your hands up, that's fine."
  },
  {
    "-2019/10/31-": "Scrabble is a board game, do you guys know board games?"
  },
  {
    "-2019/10/31-": "People used to play these things called board games."
  },
  {
    "-2019/10/31-": "There's a board game cafe downtown with a sandwich with my name. I can't eat it because it has turkey. YOU GUYS DON'T BELIEVE ME? LOOK IT UP, THEIR MENU'S ONLINE!"
  },
  {
    "-2019/10/31-": "It isn't any more tedious than anything else you have to do in first year engineering"
  },
  {
    "-2019/10/31-": "Why would anyone have a name that's 4 billion characters long?"
  },
  {
    "-2019/10/31-": "I've got one more thing to do, so SHUT UP FOR A MINUTE"
  },
  {
    "-2019/10/31-": "I say a lot of bad things about java, all of which is deserved"
  },
  {
    "-2019/10/31-": "I don't know if its a humorous hike"
  },
  {
    "-2019/10/31-": "I put my phone in airplane mode, because I don't want to get radiation into the reservoir"
  },
  {
    "-2019/10/31-": "I do not represent Matrix_tester.C"
  },
  {
    "-2019/10/31-": "You will wish you were covering linking in 116"
  },
  {
    "-2019/10/31-": "What interesting symbols do I have above the numbers on my keyboard"
  },
  {
    "-2019/10/31-": "Why would there be arbitrary reasons in a class like this"
  },
  {
    "-2019/10/31-": "Don't worry about C. C will be fine. I will take care of C"
  },
  {
    "-2019/10/31-": "Its weird at this point the awkward silence is better than the applause"
  },
  {
    "-2019/10/31-": "When people give you a bullshit reason you can't do something, you probably can. You can quote me on that, but you probably want to change the wording if you want to put it on a cross stitch"
  },
  {
    "-2019/10/31-": "If I can't explain something, I'm either lying or don't know what I'm talking about, we know I don't know what I'm talking about, but I want to disprove the first part"
  },
  {
    "-2019/10/31-": "Do what you want, just know I will mark it down. I will mark it down with extreme prejudice"
  },
  {
    "-2019/10/31-": "It was working. It was just trying to do something malicious"
  },
  {
    "-2019/10/31-": "Until you have directions, don't get in the car"
  },
  {
    "-2019/10/31-": "Is it better to write more, than to get the wrong answer"
  },
  {
    "-2019/10/31-": "Were you about to argue with me? 'no', that's too bad. I would win that argument so easily"
  },
  {
    "-2019/10/31-": "Sorry about the addition I built. Its not up to code. That Victoria real-estate, its worth $4 million"
  },
  {
    "-2019/10/31-": "It will keep going till it hits a null terminator in the wild"
  },
  {
    "-2019/11/4-": "Even software I wrote has bugs, I'm afraid"
  },
  {
    "-2019/11/4-": "Anyone else want to destroy my confidence?"
  },
  {
    "-2019/11/4-": "Its name is, predictably, Z"
  },
  {
    "-2019/11/4-": "5 is a pretty big number"
  },
  {
    "-2019/11/4-": "I don't give multiple choice exams because it's too easy to reverse engineer my psychology"
  },
  {
    "-2019/11/4-": "If I'm using a diagram, I must trust it"
  },
  {
    "-2019/11/4-": "I can, but whether I should is a different answer"
  },
  {
    "-2019/11/4-": "So now I'm.... uhhhhhhh"
  },
  {
    "-2019/11/4-": "I've got, well, nothing here"
  },
  {
    "-2019/11/4-": "I could... oooooh"
  },
  {
    "-2019/11/4-": "I can't be one of those people"
  },
  {
    "-2019/11/4-": "There's something profoundly disturbing about that observation, which we'll learn soooon"
  },
  {
    "-2019/11/4-": "People have been disturbed since October 1st"
  },
  {
    "-2019/11/4-": "Pointers are profoundly disturbing so many people"
  },
  {
    "-2019/11/4-": "For some reason, there's a strange sport among C programmers of writing Obfuscated Code"
  },
  {
    "-2019/11/4-": "THIS IS NOT AN EXAMPLE OF THAT. This is an example of somebody showing off."
  },
  {
    "-2019/11/4-": "THAT WAS A TRICK QUESTION. THE LOOP DOESN'T WORK AT ALL"
  },
  {
    "-2019/11/4-": "First conneX doesn't work, WE'RE ALL GOING TO HELL"
  },
  {
    "-2019/11/4-": "...yes, the index isn't initialized"
  },
  {
    "-2019/11/4-": "I'll wake up in the middle of a statistics lecture or something, it's like a nightmare"
  },
  {
    "-2019/11/4-": "It's a good time for me to go back into my pile of paperwork and find those notes"
  },
  {
    "-2019/11/4-": "What does printf find? Well, it finds a mysterious amulet, the number 5, two more mysterious amulets, and a box. Then it randomly found a null terminator."
  },
  {
    "-2019/11/4-": "A lot of programmers who program C are very paranoid"
  },
  {
    "-2019/11/4-": "Why do we need to know that word, Bill?"
  },
  {
    "-2019/11/4-": "I want to write as little code as possible, which SHOULD NOT BE YOUR GOAL, EVER"
  },
  {
    "-2019/11/4-": "We can't even make any noise at this point"
  },
  {
    "-2019/11/4-": "This is outrageous. We shouldn't write code like this."
  },
  {
    "-2019/11/4-": "Yeah......"
  },
  {
    "-2019/11/4-": "Bill, why do we worry about all this expression stuff?"
  },
  {
    "-2019/11/4-": "If you find a weird backdoor way to solve something in the library, go ahead"
  },
  {
    "-2019/11/4-": "You could just end up stapling 50 pages of library code to the exam or something"
  },
  {
    "-2019/11/4-": "There's another thing we can do, which we've been trying to avoid for the time being, but it's time to talk about it"
  },
  {
    "-2019/11/4-": "That would be the thing that makes us all uncomfortable"
  },
  {
    "-2019/11/4-": "Be prepared to be uncomfortable on thursday"
  },
  {
    "-2019/11/4-": "If you want to add arrows to arrows, join physics or something"
  },
  {
    "-2019/11/4-": "DO YOU NOT KNOW HOW TO TELL ANALOG TIME?!"
  },
  {
    "-2019/11/5-": "There's a thing that C programmers used to do, which is write code to be as unreadable as possible which is called obfuscated code"
  },
  {
    "-2019/11/5-": "Its called moodle or something"
  },
  {
    "-2019/11/5-": "How did that get there? I want to say I don't know, but I'm the one who did it"
  },
  {
    "-2019/11/5-": "We've been looking at this, and know that we have an appointment with a stack of pointers"
  },
  {
    "-2019/11/5-": "Our code is usually pristine"
  },
  {
    "-2019/11/5-": "You can thank university planning for making such a big room with such small chalkboard"
  },
  {
    "-2019/11/5-": "Do not write your answers in red pen"
  },
  {
    "-2019/11/5-": "Do not try to mark your own exam"
  },
  {
    "-2019/11/5-": "Put the brackets back in, because apparently its 'stupid'"
  },
  {
    "-2019/11/5-": "We will talk about that later. Its not dark enough outside yet"
  },
  {
    "-2019/11/5-": "If it tells you 10.5 you write 10.5, and ignore if it makes sense or not"
  },
  {
    "-2019/11/5-": "We can use a star to replace a star"
  },
  {
    "-2019/11/5-": "At least now you will have had a question like this, and know how it feels for the final"
  },
  {
    "-2019/11/5-": "You shouldn't follow arrows you find out in the wilderness"
  },
  {
    "-2019/11/5-": "The computer wants to take an early day"
  },
  {
    "-2019/11/5-": "You should't expect to see this question, because I know you will bring it into the exam"
  },
  {
    "-2019/11/5-": "We don't want to write obfuscated C code, unless you want to torture me"
  },
  {
    "-2019/11/5-": "We now see why we have the ++ vs ++ issue"
  },
  {
    "-2019/11/5-": "Interestingly I made this mistake yesterday. Maybe if I keep doing it, I should bring in a jar and put a coin into it every time"
  },
  {
    "-2019/11/5-": "I was going to burn through 8 minutes. I did that, but too quickly"
  },
  {
    "-2019/11/5-": "These names aren't great, even by my standards"
  },
  {
    "-2019/11/5-": "My machine I guess is trying to help me out by giving me garbage"
  },
  {
    "-2019/11/5-": "Its only better because we don't have to write it"
  },
  {
    "-2019/11/5-": "I'm becoming conditioned to take a drink whenever you applaud"
  },
  {
    "-2019/11/5-": "You can't take .5 steps, and be thankful for that, because if I could, I would put it on the midterm"
  },
  {
    "-2019/11/7-": " 'How was your day?' Good so far, I just got here an hour ago because all my classes this semester start late. I'll email you at the end of the day with how the rest went."
  },
  {
    "-2019/11/7-": "If there is and you're doing it to spite me, good for you."
  },
  {
    "-2019/11/7-": "Some of them didn't succeed, and they'll have a nice fun time taking the course again."
  },
  {
    "-2019/11/7-": "If you're an adult, you can make adult decisions, like taking that risk"
  },
  {
    "-2019/11/7-": "Hold on a second. turns to other side of the class SHUT UP!"
  },
  {
    "-2019/11/7-": "That's our warmup. Does that bother anybody?"
  },
  {
    "-2019/11/7-": "Looking good. Nothing that a trip to Austria won't fix."
  },
  {
    "-2019/11/7-": "We're all talking to each other, but no one is talking to me!"
  },
  {
    "-2019/11/7-": "Yes, it would. That's devious."
  },
  {
    "-2019/11/7-": "I could just sit in the damn audience and you could give the lecture!"
  },
  {
    "-2019/11/7-": "Sorry, ask your question again, cause there's another lecture in the room!"
  },
  {
    "-2019/11/7-": "It's opening square bracket. So now it's on the test!"
  },
  {
    "-2019/11/7-": "Sorry, maybe my mistake is saying WE have to talk about something. Maybe instead I should say I AM TALKING ABOUT SOMETHING."
  },
  {
    "-2019/11/7-": "It's gonna be on the test. It's gonna be 'WHAT QUESTION DID HE ASK AT 1:33PM ON NOVEMBER 7TH?'"
  },
  {
    "-2019/11/7-": "Hopefully you all remembered his question"
  },
  {
    "-2019/11/7-": "The next part of this lecture is all going to be exposition."
  },
  {
    "-2019/11/7-": "The answer is we're going to need it in about 5 minutes."
  },
  {
    "-2019/11/7-": "I'm glad people are making notes on how to torture us on the mark"
  },
  {
    "-2019/11/7-": "This is an object of type FILE, and it does all sorts of mysterious things"
  },
  {
    "-2019/11/7-": "Where is my file?"
  },
  {
    "-2019/11/7-": "If the file is called this, the file that I get is called this"
  },
  {
    "-2019/11/7-": "I'm sorry if it's a little bit overwhelming"
  },
  {
    "-2019/11/7-": "CATS DON'T TALK AS MUCH!"
  },
  {
    "-2019/11/7-": "I guess I'm slowly becoming allergic to first-year students"
  },
  {
    "-2019/11/7-": "If you wear 3D glasses into the midterm Ill start printing the questions in red and blue"
  },
  {
    "-2019/11/7-": "Most 3D glasses contain paper meaning I would either have to confiscate the paper or the glasses"
  },
  {
    "-2019/11/7-": "Nothing can bring us down because we are already at rock bottom."
  },
  {
    "-2019/11/7-": "Let's try to relate with each other."
  },
  {
    "-2019/11/7-": "About two weeks ago I started a small fire at my table at an Indian restaurant"
  },
  {
    "-2019/11/7-": "If I make a big deal of this, I'll just have to wait another hour to have my meal"
  },
  {
    "-2019/11/7-": "If you're also neurotic, eventually you'll find yourself in a place where you set the table on fire and it's just fine"
  },
  {
    "-2019/11/7-": "The issue is that the user wont input millions of entries by hand"
  },
  {
    "-2019/11/7-": "The questions are becoming less 'Do this thing with arrays' and more 'Do this thing'"
  },
  {
    "-2019/11/7-": "We would rather give assignment 7 some breathing room"
  },
  {
    "-2019/11/7-": "Nobody ever asks, well someone in the other lecture did"
  },
  {
    "-2019/11/7-": "On the midterm we can only subject you to so much of this"
  },
  {
    "-2019/11/7-": "If we have indigestion from the appetizer, come talk to me in office hours"
  },
  {
    "-2019/11/7-": "We need to... go find an eraser. They seem to gravitate to one side of the room"
  },
  {
    "-2019/11/7-": "In many courses you can get the answer by reverse engineering what the question is asking"
  },
  {
    "-2019/11/7-": "You might have class tomorrow, but I don't"
  },
  {
    "-2019/11/7-": "This is one thing the compiler can't do, because it doesn't know what the hell is going on. That's one thing you have in common with the compiler"
  },
  {
    "-2019/11/7-": "I didn't think about how everyone was looking at me starting a fire in the restaurant, I was thinking 'oh no, I don't get any naan'"
  },
  {
    "-2019/11/7-": "Is there a computer equivalent to hydrating?"
  },
  {
    "-2019/11/7-": "I was sympathetic at first, but I think it wants to sabotage the lecture"
  },
  {
    "-2019/11/7-": "Yes or no Noah, yes I know what you said, and I changed it to or"
  },
  {
    "-2019/11/7-": "I know its too mainstream, but I was using it before it was cool"
  },
  {
    "-2019/11/7-": "I believe in computer science, but I don't treat my computers in a humane manor"
  },
  {
    "-2019/11/7-": "A debit card is a credit card is a debit card"
  },
  {
    "-2019/11/7-": "If you crack it open, there won't be any money inside"
  },
  {
    "-2019/11/7-": "I don't have any knowledge"
  },
  {
    "-2019/11/7-": "I hope you know the value of money. I guess you do after UVic tuition"
  },
  {
    "-2019/11/7-": "fopen takes my bank account, and gives me a credit card"
  },
  {
    "-2019/11/7-": "Unless I say don't do it, you should do it"
  },
  {
    "-2019/11/7-": "I press play, and you forgot the last few seconds"
  },
  {
    "-2019/11/7-": "If I go on my proverbial 7 hour hike, I can't help you"
  },
  {
    "-2019/11/7-": "It turns out C doesn't care about this white space, but I do"
  },
  {
    "-2019/11/7-": "It looses track of reality, and complains about everything"
  },
  {
    "-2019/11/7-": "Do we need a bell or something? Then I could drag out the 'The bell doesn't dismiss you, I do' but then you would be all 'Why do you even have a bell then?'"
  },
  {
    "-2019/11/18-": "If you have another class in this room, please ask the instructor to figure out a way to make that damn door more quiet"
  },
  {
    "-2019/11/18-": "Which is of course, NOT what I want"
  },
  {
    "-2019/11/18-": "This is an EXTREMELY DANGEROUS assumption."
  },
  {
    "-2019/11/18-": "Imagine how much I slurred my words before I learned 'lexicographical ordering'"
  },
  {
    "-2019/11/18-": "I want to store the word into the text file if the word is NOT equal to pineapple."
  },
  {
    "-2019/11/18-": "I know, we're trying. There was some stuff last week, we had the midterm. I've heard a lot about how we should never ever ever have a midterm after reading break again"
  },
  {
    "-2019/11/18-": "Now that caps lock isn't working, I'm afraid this laptop won't outlast this semester"
  },
  {
    "-2019/11/18-": "It's outlasted some 111 students this semester"
  },
  {
    "-2019/11/18-": "Our attitude is the same as the weather today"
  },
  {
    "-2019/11/18-": "Other than that, we're done. We good?"
  },
  {
    "-2019/11/18-": "I never said I don't like pineapple. I said that not only is it not delicious, it's not even a fruit."
  },
  {
    "-2019/11/18-": "'If it's not a fruit, what is it?' I don't know, I'm not a biologist"
  },
  {
    "-2019/11/18-": "Clearly, that woke us up. We were talking about files, was that not enough? Did we need a discussion on pineapples?"
  },
  {
    "-2019/11/18-": "Some of you are jealous, wish you were imaginary too"
  },
  {
    "-2019/11/18-": "If they weren't imaginary, they'd be doing pretty good"
  },
  {
    "-2019/11/19-": "I'm going to give this a really obnoxious name, so that you know its not the same variable"
  },
  {
    "-2019/11/19-": "Clion should know when to be quiet"
  },
  {
    "-2019/11/19-": "Clion is trying to be a smartass ... Lets see how it does on the exam."
  },
  {
    "-2019/11/19-": "This already looks awful, but it will only get worse."
  },
  {
    "-2019/11/19-": "Be prepared to see the arrows, because I like it"
  },
  {
    "-2019/11/19-": "Have we had to access any of its members? no, we just threw pointers at it"
  },
  {
    "-2019/11/21-": "If I'm a second year student, I'm old enough to... drink... let's just skip past that"
  },
  {
    "-2019/11/21-": "Even when I took programming, I sat there critiquing people's form"
  },
  {
    "-2019/11/21-": "There are extremely serious problems"
  },
  {
    "-2019/11/21-": "What if said person is the head of your department?"
  },
  {
    "-2019/11/21-": "You're not talking any course with the vice-president"
  },
  {
    "-2019/11/21-": "I don't have tenure, but if I had tenure, then we'd all see"
  },
  {
    "-2019/11/21-": "Do you think somebody like that actually exists?"
  },
  {
    "-2019/11/21-": "Do not respond to a salary offer without talking to somebody. If you don't have anyone to talk to about it, talk to me"
  },
  {
    "-2019/11/21-": "Oh great, I had food in my teeth all day"
  },
  {
    "-2019/11/21-": "I'd rather someone told me at 7:03am than me finding out at 7pm that day"
  },
  {
    "-2019/11/21-": "I'm going to harass you over the next few weeks"
  },
  {
    "-2019/11/21-": "No one else wants to complain about the chair of the department?"
  },
  {
    "-2019/11/21-": "The lectures finally depart from where the labs are going"
  },
  {
    "-2019/11/21-": "That wasn't what I meant"
  },
  {
    "-2019/11/21-": "Many of you get into SENG 265, and you will fall asleep on the midterm"
  },
  {
    "-2019/11/21-": "I'm not going around handing out second year exams to first year students, I'm not that mean"
  },
  {
    "-2019/11/21-": "Maybe this is implying my own bias, but I prefer to use the new way rather than the old fashioned way"
  },
  {
    "-2019/11/21-": "Someone aggressively said 'It's Fine'. I've heard that it's fine before."
  },
  {
    "-2019/11/21-": "I don't need any more Sharp EL-510s"
  },
  {
    "-2019/11/21-": "They don't make them like they used to"
  },
  {
    "-2019/11/21-": "I feel kind of bad stealing calculators from people on the midterm"
  },
  {
    "-2019/11/21-": "This is not very much fun when structures get more complicated"
  },
  {
    "-2019/11/21-": "That is great, go ahead and do that"
  },
  {
    "-2019/11/21-": "For you in the territories: I'm so sorry. I know the distinction. I have a PhD"
  },
  {
    "-2019/11/21-": "It's one of the things you have to know to get a PhD"
  },
  {
    "-2019/11/21-": "...blackmail you and stuff. Very common thing these days."
  },
  {
    "-2019/11/21-": "gets, exists. DON'T USE IT!"
  },
  {
    "-2019/11/21-": "Let's look at the manual for gets. Let's see what it does... it says NEVER USE THIS FUNCTION. It even manages to somehow underline it."
  },
  {
    "-2019/11/22-": "If anybody copies off of someone, it is very likely neither of them is doing very well"
  },
  {
    "-2019/11/22-": "Left projector doesn't know how good it's had it"
  },
  {
    "-2019/11/22-": "'Bill for a scratchy throat you need two things honey, and whiskey.' This was at 9 am in the morning. I'm not going to do that. Its too early for honey"
  },
  {
    "-2019/11/22-": "I like voting because I like complaining"
  },
  {
    "-2019/11/22-": "You wouldn't get your final grade before the final day of class, so it doesn't make sense that you have to grade the course before the final day"
  },
  {
    "-2019/11/22-": "Its in the department of Computer Science. Maybe I should put that on the exam. Its not in the department of 'Physics.' Especially not physics"
  },
  {
    "-2019/11/22-": "Don't complain about me to me"
  },
  {
    "-2019/11/22-": "They do buy red pens by the crate here, and that's just for me"
  },
  {
    "-2019/11/22-": "We're making noise, but not asking questions"
  },
  {
    "-2019/11/22-": "Which one is right? This one is on the right, but its not right"
  },
  {
    "-2019/11/22-": "Either its good, or your in denial about it"
  },
  {
    "-2019/11/22-": "If I run this, hopefully it doesn't surprise anyone ... Ok a few people"
  },
  {
    "-2019/11/22-": "I'm going to make an executive decision that this is correct"
  },
  {
    "-2019/11/22-": "I know it might be treason, but I'm going to do it anyways"
  },
  {
    "-2019/11/22-": "We don't hold it against you, we just take off the marks"
  },
  {
    "-2019/11/22-": "Two people answered. Of the five people who reported being here today, that's 40%. That's pretty good"
  },
  {
    "-2019/11/22-": "Is something wrong? Has the room been invaded by bees?"
  },
  {
    "-2019/11/22-": "Don't write this down"
  },
  {
    "-2019/11/22-": "We never trust the user. 'But Bill what if I'm the user?' Then we especially don't trust you"
  },
  {
    "-2019/11/22-": "It doesn't matter how we code it. Its someone else's problem"
  },
  {
    "-2019/11/22-": "There's this building called the Petch building. Has anybody heard about it?"
  },
  {
    "-2019/11/22-": "scanf() is offering a service, and when you use it you are taking a risk"
  },
  {
    "-2019/11/22-": "Why is it crashing when I put  in a 4000 character province code?"
  },
  {
    "-2019/11/22-": " 'Wait a minute, imaginary computer money doesn't have any value' "
  },
  {
    "-2019/11/22-": "That would be at international espionage levels, which I imagine some of you will get into"
  },
  {
    "-2019/11/22-": "Even the dreaded g word is better than gets()... Well gets() is a g word."
  },
  {
    "-2019/11/25-": "If the array is big enough, it takes so long to do that, in a practical sense, it's not actually working"
  },
  {
    "-2019/11/25-": "Even I'M thinking the questions are rhetorical because they're getting so few answers!"
  },
  {
    "-2019/11/25-": "This isn't even a rhetorical question!"
  },
  {
    "-2019/11/25-": "I DON'T KNOW HOW MUCH MORE STRONGLY I HAVE TO HINT AT THIS"
  },
  {
    "-2019/11/25-": "Be happy you're not one of my possessions"
  },
  {
    "-2019/11/25-": "I might be driving around something that's destroying the environment"
  },
  {
    "-2019/11/25-": "I try not to drive very often because I'm aware of the environmental impact"
  },
  {
    "-2019/11/25-": "We're doing a lot of cutting-edge analogy research here at UVic"
  },
  {
    "-2019/11/25-": "I'm going to assume the lack of response is because we're all getting out a calculator"
  },
  {
    "-2019/11/25-": "I don't want to confuse people any more than they might already be"
  },
  {
    "-2019/11/25-": "I go through a lot of shoelaces"
  },
  {
    "-2019/11/26-": "3 more of these. I have to get through 3 more of these still conscious"
  },
  {
    "-2019/11/26-": " 'Memory Allocation is a bit of a mouthful, isn't it Bill?' Well, yes it is weird 70s guy. That's why it has the name malloc. That sure is a final boss name."
  },
  {
    "-2019/11/26-": "Don't make me come back there. Seriously, don't make me come back there, its a lot of walking"
  },
  {
    "-2019/11/26-": "Our friend the left projector thinks its on"
  },
  {
    "-2019/11/26-": "Its not likely to be fun.... that's it"
  },
  {
    "-2019/11/26-": "I turn it off and on again. In computer science that's all we know for debugging electronics"
  },
  {
    "-2019/11/26-": "You may notice that my chalk erases easily"
  },
  {
    "-2019/11/26-": "I'm going to be a lot more modest this time. One million elements"
  },
  {
    "-2019/11/26-": "To make the array bigger, we can pretend the array is bigger"
  },
  {
    "-2019/11/26-": "The exam is out of 80 marks, whatever that's supposed to mean"
  },
  {
    "-2019/11/26-": "I have to be able to see you behind the tower of paper you bring"
  },
  {
    "-2019/11/26-": "Don't quote me on that for other classes"
  },
  {
    "-2019/11/26-": "'No calculator watches.' If you bring it, I will keep it"
  },
  {
    "-2019/11/26-": "If you try to make a flambé, I will confiscate it"
  },
  {
    "-2019/11/26-": "If the program crashes, it hints at me having a bug"
  },
  {
    "-2019/11/26-": "We will blame the left projector"
  },
  {
    "-2019/11/26-": "I guess its in my hands as to when this garbage gets recycled"
  },
  {
    "-2019/11/26-": "Warning: sizeof is not a magic way of determining the size of arrays"
  },
  {
    "-2019/11/26-": "Can you pass a type as an argument? In 111, NO! In 116, we are doing that this week"
  },
  {
    "-2019/11/26-": "The brackets are a superfluous addition to make me feel more calm"
  },
  {
    "-2019/11/26-": "I have to get an amorphous blob of bytes, and sculpt them into what we want"
  },
  {
    "-2019/11/26-": "Our friends over there...colleagues. What? I'm being collegial. That's how you talk in a collegial setting, like college, or a University. At least I think"
  },
  {
    "-2019/11/26-": "Once you have freed it, you can't free it again"
  },
  {
    "-2019/11/26-": "They are formally now garbage"
  },
  {
    "-2019/11/26-": "I don't remember teaching that in 111"
  },
  {
    "-2019/11/26-": "Its the pathway to powers we think are unnatural"
  },
  {
    "-2019/11/27-": "We order pallets of red pens and it's all your fault"
  },
  {
    "-2019/11/28-": "If people come up with some way on the exam of not exhibiting the knowledge they were supposed to be exhibiting, I'll probably be fine with it"
  },
  {
    "-2019/11/28-": "Now 116 exam questions are really long, because I have to list all the stupid shit they can't do"
  },
  {
    "-2019/11/28-": "I'll grudgingly give you the marks"
  },
  {
    "-2019/11/28-": "In the past, people have found ways of subverting my own exam questions"
  },
  {
    "-2019/11/28-": "You have to be in charge when you forget to deallocate the last pointer to something"
  },
  {
    "-2019/11/28-": "The process of disposing garbage you no longer need requires a little time"
  },
  {
    "-2019/11/28-": "Memory leaks are pretty much inevitable"
  },
  {
    "-2019/11/28-": "I only have one analogy"
  },
  {
    "-2019/11/28-": "We can go to the food court at the mall. People go to the food court, they buy whatever garbage they buy. When they finish eating, they have a bunch of trash."
  },
  {
    "-2019/11/28-": "If one person throws the garbage on the floor, who cleans it up?"
  },
  {
    "-2019/11/28-": "When we're done, is the food court clean?"
  },
  {
    "-2019/11/28-": "Someone's alarm rings in the backNow clearly it's time for me to stop talking about this topic and move onto the next one"
  },
  {
    "-2019/11/28-": "It's certainly some old historical relic that's now only there for shenanigans"
  },
  {
    "-2019/11/28-": "...it was maybe an attempt at one, but nobody cares anymore..."
  },
  {
    "-2019/11/28-": "Now we can do anything we want with data, what do we do with data?"
  },
  {
    "-2019/11/28-": "The 10 would tell me, Hello, I'm the number 10!"
  },
  {
    "-2019/11/28-": "The 187 says, I'm the number 187... no it doesn't"
  },
  {
    "-2019/11/28-": "So we can foresee that this is something that will not to be fun to write in code"
  },
  {
    "-2019/11/28-": "And the 17 says what, there's nothing after me..."
  },
  {
    "-2019/11/28-": "We're all here in November, so left projector has no excuse"
  },
  {
    "-2019/11/28-": "We may, and by may, I mean we will now that you bring that up"
  },
  {
    "-2019/11/28-": "I have many solutions, and none of them involve calling the number"
  },
  {
    "-2019/11/28-": "Now you definitely will because I said you can"
  },
  {
    "-2019/11/28-": "Look to your left. Look to your right. None of you have completed the survey"
  },
  {
    "-2019/11/28-": "Its recently come to my attention that there are people who come to both lectures. There is also at least one person from a second year lecture. Maybe he fell asleep in his lecture, and just hasn't left yet"
  },
  {
    "-2019/11/28-": "Its not great, but its the mall"
  },
  {
    "-2019/11/28-": "Using this analogy has soured me to the experience"
  },
  {
    "-2019/11/28-": "Say you have to write a C program to regulate a nuclear reactor. How would that work? I don't know. I'm not a physicist"
  },
  {
    "-2019/11/28-": "There is no scaffolding, no starter code. This means we are in for trouble"
  },
  {
    "-2019/11/28-": "Apparently cutting the paper into pieces didn't solve everything"
  },
  {
    "-2019/11/28-": "Whether we like this thing or not, and we won't like it"
  },
  {
    "-2019/11/28-": "We saw this a week ago, and we didn't like it. Do we like it any more now? I didn't think so"
  },
  {
    "-2019/11/28-": "My personal taste has a lot of weight in this kind of course"
  },
  {
    "-2019/11/28-": "Looking down on people sounds kinda fun"
  },
  {
    "-2019/11/28-": "We will make one later, but we will try not to look right at it"
  },
  {
    "-2019/11/28-": "People will be throwing chalk at me if I use a for loop"
  },
  {
    "-2019/11/28-": "If you didn't already have indigestion, this one will give it to you"
  },
  {
    "-2019/11/28-": "I put my value in the node. Its surprising how many people forget that"
  },
  {
    "-2019/11/28-": "Can we agree this example is bad enough without 2 stars"
  },
  {
    "-2019/11/28-": "We shouldn't call that cheating"
  },
  {
    "-2019/11/28-": "Now we hold our breath. Lets see how long we can hold it"
  },
  {
    "-2019/12/2-": "I'm teetering on the lack of consciousness right now"
  },
  {
    "-2019/12/2-": "Suddenly, Bill's getting generous"
  },
  {
    "-2019/12/2-": "Yes, part 3 is a thing"
  },
  {
    "-2019/12/2-": "Strings in C are a really big deal"
  },
  {
    "-2019/12/2-": "OK COME ON"
  },
  {
    "-2019/12/2-": "This style of diagram is not a scoping diagram"
  },
  {
    "-2019/12/2-": "I would like to store a bunch of stuff, and instead of being able to insert and remove, I'd like to be able to search it easily"
  },
  {
    "-2019/12/2-": "Does this list contain the number 6? There's a billion things..."
  },
  {
    "-2019/12/2-": "Maybe try giving some of the numbers you were given"
  },
  {
    "-2019/12/2-": "We've got one person in attendance today"
  },
  {
    "-2019/12/2-": "We're not going to make this in C, although hopefully you can appreciate why we're not going to make this in C"
  },
  {
    "-2019/12/2-": "This is a delicate subject at first"
  },
  {
    "-2019/12/2-": "How many of us like the continue statement?"
  },
  {
    "-2019/12/2-": "It doesn't come up that often, except by certain people who love using it"
  },
  {
    "-2019/12/2-": "Strangely, I have this weird contradiction of a structure with one member"
  },
  {
    "-2019/12/2-": "Do we all want to work with node** today?"
  },
  {
    "-2019/12/2-": "You might be able to see that you have to be careful of how you do these"
  },
  {
    "-2019/12/2-": "There's no directions to the previous thing"
  },
  {
    "-2019/12/2-": "I guess I could make a copy of the value, called 'for safekeeping'"
  },
  {
    "-2019/12/2-": "Is this enough to maybe believe we don't have any glaring errors?"
  },
  {
    "-2019/12/2-": "That becomes a tangled mess"
  },
  {
    "-2019/12/2-": "This node here, there's nothing for it, so it goes to NULL"
  },
  {
    "-2019/12/2-": "Doubly linked lists, as I said, are very tedious"
  },
  {
    "-2019/12/2-": "There is quite a bit of bookkeeping"
  },
  {
    "-2019/12/2-": "I am doing 4 pointer assignments"
  },
  {
    "-2019/12/2-": "I'd say that's reasonable"
  },
  {
    "-2019/12/2-": "That's a strange observation, the kind of observation we should be worried about"
  },
  {
    "-2019/12/2-": "I WANT NO LOOPS"
  },
  {
    "-2019/12/2-": "Although we may be fed up of this by now, but this will be the last program we're writing together"
  },
  {
    "-2019/12/2-": "Hopefully the nostalgia outweighs the sense of fear some people get while writing this"
  },
  {
    "-2019/12/2-": "How do I write something without loops? That's a difficult task. I'm a humble guy"
  },
  {
    "-2019/12/2-": "I guess if you gave me an empty list, I could handle that"
  },
  {
    "-2019/12/2-": "Maybe I got 1 out of 5"
  },
  {
    "-2019/12/2-": "DO I HAVE A FUNCTION THAT I CAN CALL?"
  },
  {
    "-2019/12/2-": "DO I BELIEVE? YES I DO"
  },
  {
    "-2019/12/2-": "I'm allowed to reassign the work back to myself"
  },
  {
    "-2019/12/2-": "I did the absolute minimum amount of work, and said 'The rest is someone else's problem', and that someone else was me"
  },
  {
    "-2019/12/2-": "I take the code that I duly copy and pasted, and I copy and paste down here"
  },
  {
    "-2019/12/2-": "Clearly this computer is waiting for the semester to end"
  },
  {
    "-2019/12/2-": "It's very brave of you for choosing CSC 111 over 110"
  },
  {
    "-2019/12/2-": "Now it's been 3 and a half months, and you're all programmers!"
  },
  {
    "-174/10/89-": "I always welcome attempts to massage my ego."
  },
  {
    "-174/10/89-": "I like toast, and I like talking about toast."
  },
  {
    "-2019/10/23-": "You're engineers, you take your socks off first."
  },
  {
    "-2019/10/30-": "You can choose to make anyone your friend if you wish to give them access to your private members."
  },
  {
    "-2019/10/30-": "You could've just stayed quiet the whole time! At least you would have been consistent!"
  },
  {
    "-174/11/39-": "I will not hear anybody speaking ill of raspberries,"
  },
  {
    "-2019/11/18-": "People get impatient when the testing isn't posted after infinity time."
  },
  {
    "-2019/11/18-": "I started a small fire at my table in an Indian restaurant about a week ago… I didn't want to start anything, because then I wouldn't get to finish my meal."
  },
  {
    "-2019/11/20-": "I was about to reflexively write raspberry--where's raspberry in this program?"
  },
  {
    "-2019/11/25-": "The bell doesn't dismiss you, I do."
  },
  {
    "-2019/11/27-": "Ok, well, optimistic answer not found."
  },
  {
    "-174/12/19-": "My brain has a mind."
  },
  {
    "-174/12/19-": "Things have gotten a bit non-linear for me today."
  },
  {
    "-174/12/39-": "If you talk about this in terms of C++, which Alan Turing did not know,"
  },
  {
    "-174/12/39-": "...students found out that if you called him 'Dan' ... his name was Danger Man."
  },
  {
    "-174/12/39-": "You figured now the respectfulness is out the window, who gives a shit."
  }
]
