[
  {
    "createdTimestamp": "2019/09/12",
    "content": "An empty array is filled with zeros. This array represents your grades"
  },
  {
    "createdTimestamp": "2019/09/12",
    "content": "java is like your mom, it takes care of you. C will let you drive your car right off the track"
  },
  {
    "createdTimestamp": "2019/09/12",
    "content": "Java won't let you do what you want, C on the other hand let's you do whatever which is great cause if I want to do something dumb I don't want to let a language stop me"
  },
  {
    "createdTimestamp": "2019/09/12",
    "content": "I can't do math in public."
  },
  {
    "createdTimestamp": "2019/09/12",
    "content": "This toast isn't magnetic."
  },
  {
    "createdTimestamp": "2019/09/12",
    "content": "Has anyone actually verified that I work for the university?"
  },
  {
    "createdTimestamp": "2019/09/12",
    "content": "mistake? NO! BECAUSE I BELIEVE IN MYSELF."
  },
  {
    "createdTimestamp": "2019/09/16",
    "content": "You have a wallet, I have a wallet. What's the difference? Mine has a lot of money in it. Remember, tuition's due in two weeks."
  },
  {
    "createdTimestamp": "2019/09/16",
    "content": "What takes more time: drawing a diagram or retaking the course again next year?"
  },
  {
    "createdTimestamp": "2019/09/16",
    "content": "They do things there with cheese curds that you'd only imagine"
  },
  {
    "createdTimestamp": "2019/09/16",
    "content": "Go to Quebec and spend a thousand dollars on fried chicken"
  },
  {
    "createdTimestamp": "2019/09/16",
    "content": "There's a variable out here and it's kind of... chilly, and weird, and spooky."
  },
  {
    "createdTimestamp": "2019/09/16",
    "content": "I shouldn't trust my own thoughts, and you should consider not trusting yours"
  },
  {
    "createdTimestamp": "2019/09/16",
    "content": "This demo will take up the last 5 minutes, and thats my passive agressive way of telling you there is 5 minutes left in class"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "We dont care how the toaster works, we just care that the toaster works"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "It would be great if everybody just left; that's fine, I'd just leave too!"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "Is anybody here today?"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "No"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "I gotta hydrate first, this is going to be a tough one"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "I'd bet, if some of you reach into your pockets you'd pull out a wallet"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "If you pull out your wallet, should I expect you to pull out my credit card?"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "Now I realize you all just have this weird applause fetish"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "If you reach into your wallet and pull out my credit card that would be impressive"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "Nobody is reacting, and that means everyone with a monday or tuesday lab has dropped the course"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "We have to give them a name... I guess"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "Really its the University's fault for having seats there"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "The way you become comfortable is by being uncomfortable and just doing it"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "Anyone else want to leave in protest of this being an operator?"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "You have no idea how much of the stationary budget goes into red pens"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "Ive prepared the next half hour of the lecture hoping that you would ask that question"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "Instead of notes you can also bring one standard letter sized sheet of paper. I will provide the dimensions closer to the time"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "I do not understand the linear passage of time"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "If I go into the horrifying nothingness and find nothing, then I return a compiler error"
  },
  {
    "createdTimestamp": "2019/09/17",
    "content": "The chalk is leaving in protest"
  },
  {
    "createdTimestamp": "2019/09/18",
    "content": "the computer and I have been together for years, so it's sorta like a old married couple"
  },
  {
    "createdTimestamp": "2019/09/18",
    "content": "the course is bill bird."
  },
  {
    "createdTimestamp": "2019/09/18",
    "content": "try me, if you don't believe me, try me, and I'll see you next year"
  },
  {
    "createdTimestamp": "2019/09/18",
    "content": "HOW IS THE BATTERY LOW? oh I didn't have it plugged in"
  },
  {
    "createdTimestamp": "2019/09/18",
    "content": "oh, I didn't plug it in, old married couple problems, you know"
  },
  {
    "createdTimestamp": "2019/09/18",
    "content": "I mean pointers are great, I love pointers, some of my best friend are pointers"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "IF ONLY THERE WAS SOMETHING I COULD WRITE IN THE C LANGUAGE THAT COULD TEST SOMETHING FOR ME!"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Maybe the tech people are scared of me, and that's why they showed up so quickly"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "The diagram does the work for us"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Oh shit, I don't know my name"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "As long as you get toast, how you create the toast doesn't matter as long as it does the job it's supposed to"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "I'll go to my office and wait for the call from HR. I'm sure they've got me on speed dial at this point"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Once you've designed a complete toaster, I assume it's going to follow the rules"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "YOU HAVE PAID FOR 3 MORE MINUTES OF MY VALUABLE TIME, SO YOU'RE GONNA DAMN LISTEN"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "I'M STILL NOT DONE TALKING"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "We had some fun times with the projector. We laughed, we cried, we mostly cried"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "The chalk doesn't believe me either"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "It's not that bad! Some of you won't be there by then!"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Am I gonna moan about being back at my office at 6:00pm? Damn right I am! I earned that right!"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Well yes it's true that I go home after six and listen to a spotify playlist of applause"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "If someone brings a sheet of carbon paper to an exam I will like them so much that I will fail them so I can see them next year"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Something seems dissonant about 7"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Is someone going to close the door? No, I guess the people in the lobby are going to learn programming I guess"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Assignment 1 went well for everybody, assignment 2 will not go so well."
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "The computer screen is just motivational text"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Would you like me to pull this from linear algebra instead?"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Assignment 5 wont be that bad, some of you wont be here then"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "Anyone want to keep moaning because math is hard?"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "How do I print out a stair?"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "There is this wonderful recording of applause from Europe"
  },
  {
    "createdTimestamp": "2019/09/19",
    "content": "If you remember correctly one of the pre requisites for this class was fourth grade"
  }
]
